Разработка_GZ/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <comment>Подразделение является обособленным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксБП20</name>
    <comment>Префикс для формирования номера документов (БП 2.0)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочиванияИерархического</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяемыйЛьготныйТерриториальныйТариф</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляЗаписейОТрудовойДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыСотрудников</name>
    <type>
      <types>DefinedType.ГрафикРаботыСотрудниковПодразделенияОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетНомерТерриториальногоОрганаРосстата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТерриториальногоОрганаРосстата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСевернойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганаФСГС</name>
    <comment>Код территориального органа государственной статистики </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяКлассификационнаяЕдиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment> Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Разработка_GZ/src/CommonModules/ПравилаРаспределенияРасходовМодификацияКонфигурации/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// 
// Процедуры, переопределяемые при модификации конфигурации.
// Позволяют гибко устанавливать правила распределения расходов.
// Вызываются из модуля ПравилаРаспределенияРасходов
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет настройки распределения.
// Позволяет учесть настройки, предусмотренные на проекте автоматизации конкретного предприятия.
//
// Параметры:
//  Настройки - Структура - см. ПравилаРаспределенияРасходов.НовыйНастройкиУчетаЗатрат, заполненные настройки
//
Процедура ПриЗаполненииНастроекУчетаЗатрат(Настройки) Экспорт
	
	// Пример модификации приведен в ЗакрыватьОбщехозяйственныеРасходыНаКалькуляционныйСчет()
	
КонецПроцедуры

// Переопределяет таблицу правил распределения.
// Позволяет добавить свои правила так, чтобы их налоговые последствия были обработаны автоматически.
// Вызывается после заполнения таблицы основными предопределенными правилами по конкретному счету расходов,
// но до заполнения налоговыми правилами.
//
// Параметры:
//  Процессор  - Структура - см. ПравилаРаспределенияРасходов.НовыйПроцессорЗаполненияПравилРаспределения
//               Правила следует добавлять с помощью ПравилаРаспределенияРасходов.ДобавитьПравилоРаспределения
//               Не рекомендуется удалять правила, менять порядок предопределенных правил, менять в них отбор по счету.
//  СтандартнаяОбработка 
//             - Булево - действие после выполнения обработчика
//               * Истина - Значение по умолчанию. После правил, добавленных в этой процедуре,
//                          будут добавлены предопределенные правила.  
//               * Ложь   - Применяются только правила, добавленные в этой процедуре.
//                          Позволяет полностью переопределить логику типового решения, 
//                          отказаться от использования предопределенных правил
// 
Процедура ПередДобавлениемПравилПоСчету(Процессор, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Переопределяет таблицу правил распределения.
// Позволяет добавить свои правила так, чтобы их налоговые последствия были обработаны автоматически.
// Вызывается после заполнения таблицы основными предопределенными правилами,
// но до заполнения налоговыми правилами.
//
// Параметры:
//  Процессор - Структура - см. ПравилаРаспределенияРасходов.НовыйПроцессорЗаполненияПравилРаспределения
//              Правила следует добавлять с помощью ПравилаРаспределенияРасходов.ДобавитьПравилоРаспределения
//              или ПравилаРаспределенияРасходов.СкопироватьПравилоРаспределения
//              Не рекомендуется удалять правила, менять порядок предопределенных правил, менять в них отбор по счету.
//
Процедура ПриДобавленииПравилПоСчету(Процессор) Экспорт
	
	// О структуре правила см. комментарий в ПравилаРаспределенияРасходов.НовыеПравилаРаспределения
	
	// Для поиска предопределенного правила, подлежащего модификации, можно использовать ФункциональноеИмя предопределенных правил.
	// Однако, надежнее опираться на свойства предопределенных правил, как показано ниже.
	
	// Пример модификации правила, позволяющего ограничить распределение косвенных затрат на другие подразделения,
	// приведен в ОграничитьРаспределениеНаДругиеПодразделения()
	
КонецПроцедуры

// Переопределяет таблицу правил распределения.
// Вызывается до заполнения таблицы предопределенными правилами.
// 
// Параметры:
//  ПравилаРаспределения - ТаблицаЗначений - заполняемая таблица; 
//                         структура таблицы описана в ПравилаРаспределенияРасходов.НовыеПравилаРаспределения()
//  Период               - Дата - указывает на период, расходы которого распределяются
//  Организация          - СправочникСсылка.Организации - организация, расходы которой распределяются
//  СтандартнаяОбработка - Булево - действие после выполнения обработчика
//                         * Истина - Значение по умолчанию. После правил, добавленных в этой процедуре,
//                                    будут добавлены предопределенные правила.  
//                         * Ложь   - Применяются только правила, добавленные в этой процедуре.
//                                    Позволяет полностью переопределить логику типового решения, 
//                                    отказаться от использования предопределенных правил
// 
Процедура ПередДобавлениемПравилРаспределенияРасходовНаПроизводство(ПравилаРаспределения, Период, Организация, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Переопределяет таблицу правил распределения.
// Вызывается после заполнения таблицы предопределенными правилами.
// 
// Параметры:
//  ПравилаРаспределения - ТаблицаЗначений - заполняемая таблица; 
//                         структура таблицы описана в ПравилаРаспределенияРасходов.НовыеПравилаРаспределения()
//  Период               - Дата - указывает на период, расходы которого распределяются
//  Организация          - СправочникСсылка.Организации - организация, расходы которой распределяются
// 
Процедура ПриДобавлениПравилРаспределенияРасходовНаПроизводство(ПравилаРаспределения, Период, Организация) Экспорт
	
	// См. комментарии в ПриДобавленииПравилПоСчету()
	
КонецПроцедуры

// Переопределяет таблицу правил распределения.
// Вызывается до заполнения таблицы предопределенными правилами.
// 
// Параметры:
//  ПравилаРаспределения - ТаблицаЗначений - заполняемая таблица; 
//                         структура таблицы описана в ПравилаРаспределенияРасходов.НовыеПравилаРаспределения()
//  Период               - Дата - указывает на период, расходы которого распределяются
//  Организация          - СправочникСсылка.Организации - организация, расходы которой распределяются
//  СтандартнаяОбработка - Булево - действие после выполнения обработчика
//                         * Истина - Значение по умолчанию. После правил, добавленных в этой процедуре,
//                                    будут добавлены предопределенные правила.  
//                         * Ложь   - Применяются только правила, добавленные в этой процедуре.
//                                    Позволяет полностью переопределить логику типового решения, 
//                                    отказаться от использования предопределенных правил
// 
Процедура ПередДобавлениемПравилРаспределенияРасходовНаПродажу(ПравилаРаспределения, Период, Организация, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Переопределяет таблицу правил распределения.
// Вызывается после заполнения таблицы предопределенными правилами.
// 
// Параметры:
//  ПравилаРаспределения - ТаблицаЗначений - заполняемая таблица; 
//                         структура таблицы описана в ПравилаРаспределенияРасходов.НовыеПравилаРаспределения()
//  Период               - Дата - указывает на период, расходы которого распределяются
//  Организация          - СправочникСсылка.Организации - организация, расходы которой распределяются
// 
Процедура ПриДобавленииПравилРаспределенияРасходовНаПродажу(ПравилаРаспределения, Период, Организация) Экспорт
	
	// См. комментарии в ПриДобавленииПравилПоСчету()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Примеры

Процедура ЗакрыватьОбщехозяйственныеРасходыНаКалькуляционныйСчет(Настройки)  Экспорт // для обхода проверки конфигурации
	
	// С 2021 года обязательно для применения ФСБУ 5, для исполнения требований которого в типовом решении
	// счет 26 "Общехозяйственные расходы" закрывается на счет финансового результата периода.
	
	// Однако, специфика деятельности отдельных организаций может требовать продолжать закрывать
	// этот счет на калькуляционные счета (20, 23),
	// например, в связи с особенностями финансирования заключенных договоров.
	
	// Это допустимо в случаях, не входящих в сферу регулирования ФСБУ 5, например,
	// когда речь идет о выполнении строительных работ, по которым выручка и расходы признаются по мере готовности.
	
	Если Настройки.Контекст.Период < '2021-01-01' Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.Закрытие[ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы].Направление = "КалькуляционныйСчет";
	
КонецПроцедуры

Процедура ОграничитьРаспределениеНаДругиеПодразделения(Процессор) Экспорт // для обхода проверки конфигурации
	
	// Пример модификации правила, позволяющего ограничить распределение косвенных затрат на другие подразделения.
	
	// В типовом решении косвенные затраты распределяются по указанной базе
	// - прежде всего в рамках одного подразделения
	// - если это невозможно - в рамках всех подразделений, для которых расчитана эта база.
	//
	// Например, если база распределения - "объем выпуска" и выпуск есть в подразделениях "Цех 1" и "Цех 2",
	// то затраты Цеха 1 будут распределены только на выпуск Цеха 1, а затраты Лаборатории - на оба цеха.
	//
	// На предприятиях, результаты работы которого оплачиваются заказчиком в виде компенсации затрат,
	// могут быть ограничения такого распределения:
	// - с одной стороны, следует использовать единую базу распределения для всех затрат
	// - с другой, некоторые затраты нельзя включать в себестоимость результата деятельности, оплачиваемого заказчиком.
	//
	// В описанном выше примере может появиться подразделение "Цех специальных изделий", в себестоимость продукции которого
	// не следует включать затраты лаборатории.
	//
	// Для настройки такого ограничения используем иерархию и последовательность подразделений в списке:
	// Косвенные затраты подразделений не могут быть распределены на первое в списке.
	//
	// Например, список подразделений может выглядеть так:
	// - Цех специальных изделий
	// - Цех 1
	// - Цех 2
	// - Лаборатория
	// Косвенные затраты Лаборатории распределяются на Цех 1 и Цех 2
	//
	// Такой способ настройки приведен в демонстрационных целях.
	// На проектах рекомендуется с помощью расширения добавлять в прикладное решение объекты метаданных,
	// описывающие специфику взаимосвязей подразделений, видов деятельности, видов выпуска конкретного предприятия.
	
	Если Процессор.КлассСчетов <> "КосвенныеРасходы" Тогда
		Возврат;
	КонецЕсли;
	
	Если Процессор.Закрытие.Направление <> "КалькуляционныйСчет" Тогда
		Возврат;
	КонецЕсли;
	
	ПравилаДляМодификации = Новый Массив;
	Для Каждого Правило Из Процессор.Правила Цикл
		
		Если Правило.Действие <> "РаспределитьНаСубконто" И Не Правило.ПоляПриемника.Свойство("Подразделение") Тогда
			// Распределение между подразделениями не может быть выполнено таким правилом
			Продолжить;
		КонецЕсли;
		
		Если Правило.ПоляИсточника.Свойство("Подразделение") Тогда
			// Распределение уже ограничено одним или несколькими подразделениями
			Продолжить;
		КонецЕсли;
		
		ПравилаДляМодификации.Добавить(Правило);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ПравилаДляМодификации) Тогда
		Возврат;
	КонецЕсли;
	
	// Определим запрещенное подразделение.
	// На проектах может оказаться уместным читать такие настройки заранее и помещать в коллекцию Настройки
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Процессор.Настройки.Контекст.Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Подразделения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК Подразделения
	|ГДЕ
	|	Подразделения.Владелец = &Организация
	|	И Подразделения.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделения.РеквизитДопУпорядочивания,
	|	Подразделения.Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапрещенноеПодразделение = Выборка.Ссылка;
	
	// Модифицируем запросы базы распределения, добавив условие, ограничивающее данные базы.
	// На проектах связи могут быть сложнее:
	// одни "косвенные" подразделения могут быть ограничены в распределении одним набором подразделений или наименований продукции,
	// а другие - другим.
	// В этом случае следует использовать ПоляИсточника правила, дополняя текст запроса соединением с таблицей таких связей.
	
	Для Каждого Правило Из ПравилаДляМодификации Цикл
		
		ЗапросБазыРаспределения = СхемыЗапросов.НайтиЗапросСозданияТаблицы(
			Правило.БазаРаспределения.ТекстЗапроса,
			Правило.БазаРаспределения.Имя);
			
		КолонкаПодразделение = ЗапросБазыРаспределения.Запрос.Колонки.Найти("Подразделение");
			
		Для Каждого Оператор Из ЗапросБазыРаспределения.Запрос.Операторы Цикл
			ИндексОператора = ЗапросБазыРаспределения.Запрос.Операторы.Индекс(Оператор);
			ВыражениеПодразделение = КолонкаПодразделение.Поля[ИндексОператора];
			Оператор.Отбор.Добавить(СтрШаблон("%1 <> &ЗапрещенноеПодразделение", ВыражениеПодразделение));
		КонецЦикла;
			
		Правило.БазаРаспределения.ПараметрыЗапроса.Вставить("ЗапрещенноеПодразделение", ЗапрещенноеПодразделение);
		
		// Изменение текста или параметров запроса требует изменить имя временной таблицы - так, чтобы не оказалось,
		// что различные правила предусматривают создание разных таблиц с одинаковым именем.
		ЗапросБазыРаспределения.Запрос.ТаблицаДляПомещения = "";
		Правило.БазаРаспределения.Имя                      = "";
		ПравилаРаспределенияРасходов.НастроитьТекстБазыРаспределения(Правило, ЗапросБазыРаспределения);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецОбласти
